[
  {
  "keywords": "Bandwidth",
  "tech_explanation" : "Bandwidth didefinisikan sebagai jumlah informasi yang dapat mengalir melalui koneksi jaringan dalam periode waktu tertentu.",
  "analogy" : "Bandwidth seperti jumlah lajur di jalan raya. Jalan raya besar dengan banyak jalur lalu lintas bergabung dengan jalan yang lebih kecil dengan jalur lalu lintas yang lebih sedikit. Jalan-jalan ini mengarah ke jalan yang lebih kecil dan lebih sempit, dan akhirnya ke jalan masuk rumah dan bisnis. Ketika mobil yang menggunakan sistem jalan raya sangat sedikit, setiap kendaraan dapat bergerak dengan bebas. Ketika lalu lintas bertambah, setiap kendaraan bergerak lebih lambat, terutama di jalan dengan lajur yang lebih sedikit. Ketika semakin banyak lalu lintas memasuki sistem jalan raya, bahkan jalan raya multijalur pun akan menjadi padat dan lambat. Jaringan data sangat mirip dengan sistem jalan raya, dengan paket data yang dianalogikan dengan mobil, dan bandwidth yang dianalogikan dengan jumlah jalur di jalan raya.",
  "tag" : "#jaringan",
  "image_name" : "bandwidth",
  "isFavorite" : "false"
  },
  {
  "keywords": "API",
  "tech_explanation" : "Seperangkat definisi dan protokol untuk membangun dan mengintegrasikan perangkat lunak aplikasi. API adalah singkatan dari Application Programming Interface. API memungkinkan produk atau layanan Anda berkomunikasi dengan produk dan layanan lain tanpa harus mengetahui cara penerapannya.",
  "analogy" : "Bayangkan Anda sedang duduk di meja di sebuah restoran dengan menu pilihan untuk dipesan. Dapur adalah bagian dari 'sistem' yang akan menyiapkan pesanan Anda. Apa yang hilang adalah tautan penting untuk mengomunikasikan pesanan Anda ke dapur dan mengantarkan makanan Anda kembali ke meja Anda. Di situlah fungsi dari pelayan (API). Pelayan adalah pembawa pesan (API), yang menerima permintaan atau pesanan Anda dan memberi tahu dapur (sistem), apa yang harus dilakukan. Kemudian pelayan memberikan tanggapan kembali kepada Anda; dalam hal ini adalah makanannya.",
  "tag" : "#development",
  "image_name" : "api",
  "isFavorite" : "false"
  },
  {
  "keywords": "Back-End",
  "tech_explanation" : "Bagian dari aplikasi yang bertanggung jawab untuk menyediakan kebutuhan yang tak terlihat oleh pengguna (tidak berinteraksi langsung dengan pengguna), seperti bagaimana data disimpan, diolah, serta ditransaksikan secara aman. Itu semua bertujuan untuk mendukung aplikasi Front-End bekerja sesuai dengan fungsinya. Sosok yang menggeluti bidang ini disebut Back-End Developer.",
  "analogy" : "Back-End dapat dianalogikan seperti barista dalam kedai kopi,  contohnya seperti teknik barista membuat kopi, apa dan bagaimana cara mengoperasikan mesin kopi, laporan keuangan, biaya sewa kedai, dan hal-hal dapur tak terlihat pelanggan lainnya.",
  "tag" : "#development",
  "image_name" : "frontbackend",
  "isFavorite" : "false"
  },
  {
  "keywords": "Virtual Machine",
  "tech_explanation" : "Singkatnya, virtual machine adalah program perangkat lunak atau sistem operasi virtual yang bisa digunakan pada sebuah perangkat keras bersamaan dengan OS asli perangkat tersebut. Fungsi utama virtual machine adalah untuk melakukan tugas-tugas yang tidak bisa dilakukan pada sistem operasi asli perangkat.",
  "analogy" : "Gambaran sederhana dari implementasi teknologi ini adalah membuat ruang kedua pada komputer, di mana segala aktivitas di dalamnya tidak akan mempengaruhi keadaan komputer utama. Hal ini sangat cocok untuk uji coba program komputer seperti aplikasi atau pembaharuan sistem operasi seperti windows dan berguna membuka file yang berisiko terinfeksi virus. Contoh dalam kehidupan lainnya bisa dikatakan sebagai tempat latihan para tentara, atlet sebelum memasuki medan perang yang sebenarnya.",
  "tag" : "#sistemoperasi",
  "image_name" : "virtualmachine",
  "isFavorite" : "false"
  },
  {
  "keywords": "Firewall",
  "tech_explanation" : "sebuah software pelindung sistem jaringan komputer dan perangkat lainnya yang berguna untuk melindungi ancaman-ancaman atau konten yang berbahaya dai komputer luar.",
  "analogy" : "Agar terhindar dari sisi negatif, internet harus dilindungi oleh tembok atau benteng. Tujuannya agar komputer dan perangkat Anda bisa terlindungi dari ancaman yang membahayakan. Maka diperlukan tembok atau benteng tersebut biasanya dinamakan firewall. Bahasa gampangnya, firewall itu adalah pelindung sistem jaringan komputer dan perangkat lainnya yang berguna untuk melindungi ancaman-ancaman atau konten yang berbahaya dai komputer luar.",
  "tag" : "#software",
  "image_name" : "firewall",
  "isFavorite" : "false"
  },
  {
  "keywords": "Blockchain",
  "tech_explanation" : "Sebuah sistem penyimpanan data digital yang terdiri dari banyak server (multiserver). Pada teknologi blockchain, data yang dibuat oleh satu server dapat direplikasi dan diverifikasi oleh server lain",
  "analogy" : "Blockchain sering diibaratkan sebagai buku kas induk bank yang memuat semua data transaksi nasabah.Namun, buku kas induk ini dapat diakses oleh semua pengguna blockchain dan tidak terbatas pada petugas bank yang memiliki otoritas saja.Dengan blockchain, sebuah transaksi tidak perlu lagi bergantung pada satu server, karena transaksi yang dilakukan akan tereplikasi ke seluruh jaringan yang ada.",
  "tag" : "#teknologi",
  "image_name" : "blockchain",
  "isFavorite" : "false"
  },
  {
  "keywords": "Hosting",
  "tech_explanation" : "Sebuah tempat untuk menyimpan segala macam kebutuhan suatu website seperti gambar, file, database.",
  "analogy" : "Kalau diibaratkan rumah, Anda seperti menyewa sebuah hunian yang bisa menyimpan semua perabot Anda.",
  "tag" : "#web",
  "image_name" : "hosting",
  "isFavorite" : "false"
  },
  {
  "keywords": "Internet of Things",
  "tech_explanation" : "Suatu konsep atau program dimana sebuah objek memiliki kemampuan untuk mentransmisikan atau mengirimkan data melalui jaringan tanpa menggunakan bantuan perangkat komputer dan manusia. Internet of things atau sering disebut dengan IoT saat ini mengalami banyak perkembangan.",
  "analogy" : "Dulu, Kamu bisa menelpon dan mengirim pesan teks dengan ponsel lamamu. Tapi, sekarang kamu bisa membaca buku, menonton film, atau mendengarkan musik lewat smartphone kamu yang terhubung dengan Internet. Jadi, Internet of Things sebenarnya adalah konsep yang cukup sederhana, yang artinya menghubungkan semua objek fisik di kehidupan sehari-hari ke Internet.",
  "tag" : "#jaringan",
  "image_name" : "internetofthings",
  "isFavorite" : "false"
  },
  {
  "keywords": "Git",
  "tech_explanation" : "Salah satu tool yang sering digunakan dalam proyek pengembangan software.Git bahkan menjadi tool yang wajib dipahami oleh programmer, karena banyak digunakan di mana-mana.",
  "analogy" : "Pengontrol versi bertugas mencatat setiap perubahan pada file proyek yang dikerjakan oleh banyak orang maupun sendiri. Fungsi utama git yaitu mengatur versi dari source code program anda dengan mengasih tanda baris dan code mana yang ditambah atau diganti.",
  "tag" : "#development",
  "image_name" : "git",
  "isFavorite" : "false"
  },
  {
  "keywords": "UI/UX",
  "tech_explanation" : "UI: User Interface tampilan grafis dari sebuah sistem atau produk. Tujuan dari desain UI adalah untuk memperindah tampilan. UX: User Experience adalah bagaimana pengalaman? user dalam menggunakan suatu aplikasi atau produk. Tujuan dari desain UX adalah agar sistem/produk dapat digunakan dengan efektif",
  "analogy" : "kalau misal produknya baju, UI adalah desain dan warna/motif dari baju tersebut. Sedangkan UX adalah kenyamanan bahan, kecocokan warna, atau fitting baju ketika dipakai.",
  "tag" : "#desain",
  "image_name" : "uiux",
  "isFavorite" : "false"
  },
  {
  "keywords": "IP Address",
  "tech_explanation" : "Kode berupa rangkaian angka yang dipisah oleh titik, yang menunjukkan keberadaan sebuah device maupun network dalam jaringan internet. IP address berisi lokasi dan informasi sebuah device agar dapat saling terkoneksi antar device. IP address dapat berganti menyesuaikan lokasi dan provider iternet yang digunakan pada lokasi tersebut",
  "analogy" : "IP seperti nomor telepon rumah. Setiap nomor telepon jika dihubungi akan menuju ke rumah sesuai nomor yang dimiliki",
  "tag" : "#networking",
  "image_name" : "ipaddress",
  "isFavorite" : "false"
  },
  {
  "keywords": "Database",
  "tech_explanation" : "Kumpulan informasi yang dibutuhkan dalam suatu program",
  "analogy" : "Basis data dapat di bayangkan sebagai sebuah lemari arsip ( karena mempunyai prinsip kerja dan tujuan sama )",
  "tag" : "#development",
  "image_name" : "database",
  "isFavorite" : "false"
  },
  {
  "keywords": "Software",
  "tech_explanation" : "Program yang mengontrol aktivitas komputer",
  "analogy" : "Kalau tubuh manusia adalah komputer, hardware adalah tubuh fisik manusia",
  "tag" : "#komputer",
  "image_name" : "software",
  "isFavorite" : "false"
  },
  {
  "keywords": "Search Engine Optimization",
  "tech_explanation" : "Teknologi untuk membantu search engine menampilkan hasil search dengan konten yang relevan dari kata yang di search.",
  "analogy" : "Jika SEO adalah seperti lomba menulis cerita bertema, maka SEO adalah jurinya. SEO akan menilai pemenangnya dari ide/konsep, judul lukisan, kesesuaian tema dan cerita yang paling menarik dan mudah dimengerti. yang paling menarik diurutkan di urutan pertama",
  "tag" : "#algoritma",
  "image_name" : "seo",
  "isFavorite" : "false"
  },
  {
  "keywords": "Domain",
  "tech_explanation" : "Alamat sebuah website. Terdiri dari dua bagian yaitu domain name dan domain extension.",
  "analogy" : "Contohnya google.com adalah sebuah domain. google adalah domain name, sedangkan .com adalah extension nya.",
  "tag" : "#web",
  "image_name" : "domain",
  "isFavorite" : "false"
  },
  {
  "keywords": "Artificial Intelligence",
  "tech_explanation" : "teknologi yang dapat melakukan aktivitas yang biasanya dilakukan menggunakan kecerdasan manusia.",
  "analogy" : "Misalnya kita belajar untuk naik sepeda, maka yang perlu kita ketahui adalah bagaimana cara agar sepeda bisa kita jalankan. Selanjutnya bagaimana kita bisa seimbang dan tidak terjatuh adalah bagian dari pekerjaan otak kita. Jadi AI adalah sebuah mesin yang dapat diberi suatu perintah kemudian mengerjakannya sendiri.",
  "tag" : "#teknologi",
  "image_name" : "ai",
  "isFavorite" : "false"
  },
  {
  "keywords": "Hardware",
  "tech_explanation" : "Komponen fisik komputer. contoh: PC, memory card, kabel, peripheral devices (keyboard, mouse, USB, etc)",
  "analogy" : "Kalau tubuh manusia adalah komputer, software adalah pikiran, perasaan, skill, dan kecerdasan manusia itu",
  "tag" : "#komputer",
  "image_name" : "hardware",
  "isFavorite" : "false"
  },
  {
  "keywords": "Virtual Reality",
  "tech_explanation" : "Sebuah teknologi yang membuat pengguna atau user dapat berinteraksi dengan lingkungan yang ada dalam dunia maya yang disimulasikan oleh komputer, sehingga pengguna merasa berada di dalam lingkungan tersebut. Di dalam bahasa Indonesia virtual reality dikenal dengan istilah realitas maya.",
  "analogy" : "Ketika menggunakan virtual reality, otak dan panca indera manusia akan menghasilkan sebuah ilusi. Karena itu, banyak orang bermain game dengan menggunakan teknologi ini. Menggunakan virtual reality dapat membuat manusia merasa sedang berada di tempat tersebut, sehingga bermain game akan lebih terasa nyata, dan jauh lebih menyenangkan.",
  "tag" : "#teknologi",
  "image_name" : "vr",
  "isFavorite" : "false"
  },
  {
  "keywords": "Augmented Reality",
  "tech_explanation" : "teknologi yang menggabungkan benda maya dua dimensi dan ataupun tiga dimensi ke dalam sebuah lingkungan nyata lalu memproyeksikan benda-benda maya tersebut secara realitas dalam waktu nyata. Realitas tertambah dapat diaplikasikan untuk semua indera, termasuk pendengaran, sentuhan, dan penciuman. Selain digunakan dalam bidang-bidang seperti kesehatan, militer, industri manufaktur maupun dunia pendidikan. Teknologi AR ini dapat menyisipkan suatu informasi tertentu ke dalam dunia maya dan menampilkannya di dunia nyata dengan bantuan perlengkapan seperti webcam, komputer, HP Android, maupun kacamata khusus.",
  "analogy" : "Augmented Reality juga dapat ditemukan pada media sosial seperti Instagram. Apakah Anda mempunyai akun Instagram? Jika ya, kemungkinan besar Anda pernah menggunakan teknologi AR. Pada fitur story di Instagram, Anda dapat melakukan selfie dengan berbagai macam bingkai atau disebut filter. Ketika Anda menggunakan fitur filter ini, wajah Anda tidak berubah sama sekali di dunia nyata, bukan? Hanya saja, wajah Anda berubah di layar smartphone. Itulah teknologi augmented reality, sebuah teknologi yang berhubungan dengan dunia nyata. Kedua contoh ini, membuktikan bahwa Duluxdan Instagram menggunakan AR interactive.",
  "tag" : "#teknologi",
  "image_name" : "ar",
  "isFavorite" : "false"
  },
  {
  "keywords": "Algoritma",
  "tech_explanation" : "kumpulan perintah untuk menyelesaikan suatu masalah secara sistematis, terstruktur dan logis. Masalah itu dapat berupa apa saja, dengan syarat untuk setiap permasalahan memiliki kriteria kondisi awal yang harus dipenuhi sebelum menjalankan sebuah algoritma. Algoritma juga memiliki pengulangan proses (iterasi), dan juga memiliki keputusan hingga keputusan selesai.",
  "analogy" : "Biar nggak bingung, begini nih contoh penerapannya. Agar mobil Tesla bisa menjalankan fitur berkendara otomatis (self-driving), perlu ada algoritma yang berbunyi: “Jika peta menunjukkan perlu belok kanan, lalu belok lah kanan.” Beneran spesifik kan instruksinya? Nah, itu baru sedikit saja aturan penulisan algoritma yang bisa dicontohkan. Ada banyak lagi aturan penulisan yang bisa di pelajari nantinya.",
  "tag" : "#development",
  "image_name" : "algoritma",
  "isFavorite" : "false"
  },
  {
  "keywords": "Enkripsi",
  "tech_explanation" : "Cara mengacak data sehingga informasi tersebut hanya bisa dibaca oleh orang-orang yang memiliki aksesnya saja. Secara teknis, encryption adalah proses konversi teks biasa yang terbaca manusia (human-readable plaintext) menjadi teks yang tidak bisa dibaca dan dimengerti (incomprehensible text).",
  "analogy" : "Contohnya seperti informasi bank yang diproses melalui online account, kata sandi yang Anda input d browser",
  "tag" : "#teknologi",
  "image_name" : "enkripsi",
  "isFavorite" : "false"
  },
  {
  "keywords": "Debug",
  "tech_explanation" : "Proses untuk mencari bug tersebut biasanya disebut juga dengan proses debugging, atau proses pencarian di dalam baris kode yang meyebabkan error terjadi. Debugging adalah sebuah istilah di dalam mencari error baik pada perangkat lunak maupun pada perangkat keras.",
  "analogy" : "Selama programmer dan developer mengembangkan aplikasi atau website, mereka harus memastikan bahwa sistem yang dikembangkan dapat berjalan dengan baik. Aplikasi atau web tersebut harus terbebas dari kesalahan atau error agar bisa digunakan oleh user. Untuk memastikan hal tersebut maka mereka perlu melakukan proses debugging.",
  "tag" : "#development",
  "image_name" : "debug",
  "isFavorite" : "false"
  },
  {
  "keywords": "iOS",
  "tech_explanation" : "Pada dasarnya iOS merupakan sistem operasi mobile seperti Android, jadi kita bisa juga menganggapnya sebagai nyawa dari perangkat.",
  "analogy" : "Kita bisa mengibaratkan iOS sebagai Windows. Hanya saja, kalau Windows diperuntukkan bagi PC maupun laptop, iOS dirancang untuk perangkat iPhone, iPad dan iPod Touch.",
  "tag" : "#sistemoperasi",
  "image_name" : "ios",
  "isFavorite" : "false"
  },
  {
  "keywords": "Android",
  "tech_explanation" : "salah satu sistem operasi atau operating system berbasis mobile yang sangat banyak di gunakan sekarang ini. Utamanya pada telepon pintar (smartphone) ataupun tablet.",
  "analogy" : "Kita bisa mengibaratkan Android sebagai Windows. Hanya saja, kalau Windows diperuntukkan bagi PC maupun laptop, Android dirancang untuk perangkat smartphone.",
  "tag" : "#sistemoperasi",
  "image_name" : "android",
  "isFavorite" : "false"
  },
  {
  "keywords": "Sistem Operasi",
  "tech_explanation" : "Definisi umum dari sistem operasi adalah sebuah perangkat lunak sistem yang mampu mengelola sumber daya (resources) dari software dan hardware agar dapat berjalan dengan baik serta memudahkan proses interaksi dengan pengguna atau user (brainware). ",
  "analogy" : "Jika kita analogikan sederhana, hubungan antara operating system dengan komputer adalah seperti kendaraan bermotor dan bahan bakar. Dimana, tanpa adanya bahan bakar, tentu saja kendaraan bermotor tidak akan bisa berjalan dengan semestinya. Sama halnya dengan sistem operasi, dimana anda tidak akan bisa menggunakan perangkat komputer apabila tidak adanya OS. Begitu juga sebaliknya, apabila anda mempunyai perangkat sistem dan tidak mempunyai komputer maka menjadi tidak berguna.",
  "tag" : "#computer",
  "image_name" : "os",
  "isFavorite" : "false"
  },
  {
  "keywords": "Front-End",
  "tech_explanation" : "Segala sesuatu yang berinteraksi dengan pengguna. Dari sudut pandang pengguna, front-end identik dengan antarmuka pengguna. Dari sudut pandang developer, front-end adalah desain antarmuka dan pemrograman yang menyusun fungsi antarmuka.",
  "analogy" : "Jika dalam sebuah restoran Back-End sebagai koki maka Front-End dapat dianalogikan sebagai seorang pelayan di sebuah restoran. Jadi pelayan yang tampil muka dalam melayani pembeli secara langsung.",
  "tag" : "#development",
  "image_name" : "frontbackend",
  "isFavorite" : "false"
  },
  {
  "keywords": "Framework",
  "tech_explanation" : "Sebuah kerangka kerja yang digunakan untuk mempermudah para developer software dalam membuat dan mengembangkan aplikasi. Framework berisikan perintah dan fungsi dasar yang umum digunakan untuk membangun sebuah software aplikasi sehingga diharapkan aplikasi dapat dibangun dengan lebih cepat serta tersusun dan terstruktur dengan cukup rapi. Framework juga bisa diartikan sebagai komponen-komponen pemrograman yang sudah jadi dan siap untuk digunakan kapan saja, sehingga pengembang aplikasi tidak perlu lagi membuat script yang sama untuk tugas-tugas yang sama.",
  "analogy" : "Dapat kita analogikan bahwa dalam membangun sebuah rumah kita memerlukan desain blue print agar mempermudah kita dalam membangun sebuah rumah.",
  "tag" : "#development",
  "image_name" : "framework",
  "isFavorite" : "false"
  },
  {
  "keywords": "Gyroscope",
  "tech_explanation" : "Perangkat yang dipasang pada bingkai dan mampu mendeteksi kecepatan sudut jika bingkai berputar. Gyroscope biasanya digunakan untuk mendeteksi penyimpangan suatu objek dari orientasi yang diinginkan.",
  "analogy" : "Dapat kita analogikan adalah ketika anda bermain game tembak-tembakan seperti pubg/codm,ff. Ketika anda mengscope senjata/tembak maka itu arti dari gyroscope",
  "tag" : "#teknologi",
  "image_name" : "gyroscope",
  "isFavorite" : "false"
  },
  {
  "keywords": "Cloud",
  "tech_explanation" : "metode penyampaian berbagai layanan melalui internet. Sumber daya yang dimaksud contohnya adalah aplikasi seperti penyimpanan data, server, database, jaringan, dan perangkat lunak.",
  "analogy" : "Dapat kita analogikan, biasanya kita menyimpan banyak file di hard drive atau penyimpanan lokal di komputer atau handphone, penyimpanan berbasis cloud memungkinkan Anda menyimpan file selama Anda memiliki akses ke internet.",
  "tag" : "#teknologi",
  "image_name" : "cloud",
  "isFavorite" : "false"
  },
  {
  "keywords": "SaaS",
  "tech_explanation" : "SaaS (software as a service) adalah perangkat lunak yang dijadikan sebagai layanan dan bersifat online. SaaS juga disebut sebagai layanan aplikasi berbasis komputasi awan atau cloud.",
  "analogy" : "Dapat kita analogikan bahwa SaaS sama seperti mobil yang masuk bengkel.",
  "tag" : "#web",
  "image_name" : "saas",
  "isFavorite" : "false"
  },
  {
  "keywords": "Server",
  "tech_explanation" : "Suatu sistem komputer yang memiliki layanan khusus berupa penyimpanan data. Data yang disimpan melalui server berupa informasi dan beragam jenis dokumen yang kompleks. Layanan tersebut ditujukan khusus untuk client yang berkebutuhan dalam menyediakan informasi untuk pengguna atau pengunjungnya.",
  "analogy" : "Dapat kita analogikan bahwa server adalah sebuah lemari, kita menyimpan pakaian, baju, celana dalam lemari yang berbeda. Ada lemari baju, lemari celana, dan sebagainya.",
  "tag" : "#web",
  "image_name" : "server",
  "isFavorite" : "false"
  },
  {
  "keywords": "Image Processing",
  "tech_explanation" : "suatu bentuk pengolahan atau pemrosesan sinyal dengan input berupa gambar (image) dan ditransformasikan menjadi gambar lain sebagai keluarannya dengan teknik tertentu.",
  "analogy" : "Jadi dapat kita analogikan, biasanya kita biasa mengedit gambar/foto di aplikasi edit gambar seperti photoshop. Nah metode image processing ini dapat memudahkan kita dalam mengedit gambar tanpa harus kita yang mengedit tetapi sistem tersebut yang mengedit secara otomatis.",
  "tag" : "#teknologi",
  "image_name" : "imageprocessing",
  "isFavorite" : "false"
  },
  {
  "keywords": "Neural Network",
  "tech_explanation" : "Neural Network merupakan kategori ilmu Soft Computing. Neural Network sebenarnya mengadopsi dari kemampuan otak manusia yang mampu memberikan stimulasi/rangsangan, melakukan proses, dan memberikan output. Output diperoleh dari variasi stimulasi dan proses yang terjadi di dalam otak manusia. Kemampuan manusia dalam memproses informasi merupakan hasil kompleksitas proses di dalam otak. Kekuatan komputasi yang luar biasa dari otak manusia ini merupakan sebuah keunggulan di dalam kajian ilmu pengetahuan.",
  "analogy" : "Dapat kita analogikan misalnya, yang terjadi pada anak-anak, mereka mampu belajar untuk melakukan pengenalan meskipun mereka tidak mengetahui algoritma apa yang digunakan.",
  "tag" : "#algoritma",
  "image_name" : "neuralnetwork"
  "isFavorite" : "false"
  },
  {
  "keywords": "Virtual Private Server",
  "tech_explanation" : "Sebuah server personal yang keseluruhan teknologi dan kemampuannya digunakan oleh satu pengguna saja, sehingga tak ada pengaruh dari pengguna lain.  Berbeda dengan pengguna server bersama (shared hosting), seorang pengguna VPS dapat mengubah berbagai pengaturan dan konfigurasi dari server tersebut sesuai kebutuhannya.",
  "analogy" : "Dapat kita analogikan bahwa virtual private server adalah lemari baju pribadi. Kita biasa menyimpan pakaian kita dalam lemari pribadi.",
  "tag" : "#web",
  "image_name" : "vps",
  "isFavorite" : "false"
  },
  {
  "keywords": "SSL",
  "tech_explanation" : "SSL adalah singkatan dari Secure Socket Layer, salah satu komponen penting yang harus dimiliki website. Dengan SSL, transfer data di dalam website menjadi lebih aman dan terenkripsi. Bahkan saking pentingnya, Google Chrome melabeli website tanpa sertifikat SSL sebagai Not Secure. Apabila sistem keamanan ini ditambahkan pada website Anda, maka URL website akan berubah menjadi HTTPS. Tujuan utama pemasangan SSL adalah sebagai pengaman pertukaran data yang terjadi melalui jaringan internet.",
  "analogy" : "Dapat kita analogikan bahwa SSL adalah polisi yang mengawal presiden sedangkan data adalah presiden. Ketika presiden pergi ke mana saja maka harus dikawal sama polisi.",
  "tag" : "#web",
  "image_name" : "ssl",
  "isFavorite" : "false"
  },
  {
  "keywords": "Speech Recognition",
  "tech_explanation" : "Speech Recognition atau yang biasa dikenal dengan automatic speech recognition (ASR) merupakan suatu pengembangan teknik dan sistem yang memungkinkan komputer untuk menerima masukan berupa kata yang diucapkan.",
  "analogy" : "Dapat kita analogikan bahwa Speech Recognition adalah guru yang mendekte muridnya untuk mencatat mata pelajaran di sekolah.",
  "tag" : "#web",
  "image_name" : "speechrecognition",
  "isFavorite" : "false"
  }
  ]
